11_Video11/applications/coba-laravel/routes/web.php

SELECT * FROM `categories` WHERE `categories`.`id` in (2)
SELECT * FROM `posts` WHERE `posts`.`category_id` = 2 and `posts`.`category_id` IS not NULL
SELECT * FROM `users` WHERE `users`.`id` in (1, 2, 3)
---
Route::get('/categories/{category:slug}', function(Category $category) {
    return view('posts', [
        'title' => "Post by Category : $category->name",
        'posts' => $category->posts->load('category', 'user')

SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2)
SELECT * FROM `posts` WHERE `posts`.`user_id` = 3 and `posts`.`user_id` IS not NULL
SELECT * FROM `users` WHERE `users`.`id` in (3)
---
Route::get('/authors/{user:username}', function(User $user) {
    return view('posts', [
        'title' => "Post by Author : $user->name",
        'posts' => $user->posts->load('category', 'user'),